# Load the data set

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("task.csv")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

# 1  Load the dataset and display its shape, columns, and data types.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            490 non-null    object
 1   age                886 non-null    object
 2   salary             689 non-null    object
 3   department         859 non-null    object
 4   join_date          781 non-null    object
 5   city               851 non-null    object
 6   performance_score  899 non-null    object
 7   experience_years   873 non-null    object
 8   is_active          800 non-null    object
dtypes: object(9)
memory usage: 70.4+ KB

In [4]:
df.shape

(1000, 9)

In [5]:
df.columns

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='object')

# 2 Calculate the percentage of missing value for each columns

In [6]:
missing_percent = df.isnull().sum() * 100 / len(df)
missing_percent

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

# 3 Identify columns containg mixed data types

In [7]:
df.apply(lambda col: col.map(type).nunique())
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

# 4 Clean user id by replacing empty strings with NaN and converting value to uppercase

In [8]:
df['user_id'] = df['user_id'].replace('', pd.NA).str.upper()
print(df['user_id'])

0        USER_0
1         U1001
2         U1002
3           NaN
4           NaN
         ...
995         NaN
996       U1996
997    USER_997
998       U1998
999         NaN
Name: user_id, Length: 1000, dtype: object

# 5 convert age to numerc and replace invalid values (negative or > 100 ) with nan

In [9]:
df['age']=df['age'].replace("unknown",0)
age_numeric = pd.to_numeric(df['age'], errors='coerce')
age_numeric = age_numeric.where((age_numeric >= 0) & (age_numeric <= 100))
df['age'] = age_numeric.astype('Int64')
df[['age']].head()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,<NA>,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,0,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,<NA>,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,<NA>,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,0,25000,HR,invalid,Mumbai,3,5,True
998,U1998,<NA>,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

# 6 Clean salary by removing currency symbols and converting it to numeric.

In [10]:
df['salary'] = df['salary'].str.replace('₹','')
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,<NA>,50000.00,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000.00,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000.00,HR,NaN,Delhi,excellent,10,False
3,NaN,0,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,<NA>,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,50000.00,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,<NA>,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,0,25000.00,HR,invalid,Mumbai,3,5,True
998,U1998,<NA>,25000.00,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000.00,HR,2022-01-15,Hyderabad,excellent,five,no

# 7 Convert join_date into datetime format handling multiple date formats.

In [11]:
df['join_date'] = pd.to_datetime(df['join_date'],errors='coerce',dayfirst=True)
df['joining_year'] = df['join_date'].dt.year
df['joining_year'] = pd.to_numeric(df['joining_year'],errors='coerce')
df['joining_year'] = df['joining_year'].astype('Int32')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,<NA>,50000.00,HR,2020-01-12,DELHI,3,five,True,2020
1,U1001,30,45000.00,Finance,NaT,Delhi,3,1,yes,<NA>
2,U1002,30,25000.00,HR,NaT,Delhi,excellent,10,False,<NA>
3,NaN,0,NaN,HR,NaT,Hyderabad,excellent,5,yes,<NA>
4,NaN,<NA>,120000.75,IT,NaT,DELHI,NaN,-1,False,<NA>
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60,50000.00,HR,NaT,DELHI,2,five,NaN,<NA>
996,U1996,<NA>,NaN,IT,NaT,Mumbai,NaN,5,no,<NA>
997,USER_997,0,25000.00,HR,NaT,Mumbai,3,5,True,<NA>
998,U1998,<NA>,25000.00,NaN,NaT,Bangalore,1,0,True,<NA>
999,NaN,30,45000.00,HR,NaT,Hyderabad,excellent,five,no,<NA>

# 8 Extract joining_year from the cleaned join_date.

In [12]:
df['joining_year'] = pd.to_numeric(df['joining_year'],errors='coerce')
df['joining_year'] = df['joining_year'].astype('Int32')
df['joining_year']

0      2020
1      <NA>
2      <NA>
3      <NA>
4      <NA>
       ...
995    <NA>
996    <NA>
997    <NA>
998    <NA>
999    <NA>
Name: joining_year, Length: 1000, dtype: Int32

# 9  Standardize department values by trimming spaces and converting to uppercase.

In [13]:
df['department']=(df['department'].str.strip().str.upper())
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,<NA>,50000.00,HR,2020-01-12,DELHI,3,five,True,2020
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3,1,yes,<NA>
2,U1002,30,25000.00,HR,NaT,Delhi,excellent,10,False,<NA>
3,NaN,0,NaN,HR,NaT,Hyderabad,excellent,5,yes,<NA>
4,NaN,<NA>,120000.75,IT,NaT,DELHI,NaN,-1,False,<NA>
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60,50000.00,HR,NaT,DELHI,2,five,NaN,<NA>
996,U1996,<NA>,NaN,IT,NaT,Mumbai,NaN,5,no,<NA>
997,USER_997,0,25000.00,HR,NaT,Mumbai,3,5,True,<NA>
998,U1998,<NA>,25000.00,NaN,NaT,Bangalore,1,0,True,<NA>
999,NaN,30,45000.00,HR,NaT,Hyderabad,excellent,five,no,<NA>

# 10  Normalize city names to a consistent case and spelling.

In [14]:
df['city']=(df['city'].str.strip().str.title())
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,<NA>,50000.00,HR,2020-01-12,Delhi,3,five,True,2020
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3,1,yes,<NA>
2,U1002,30,25000.00,HR,NaT,Delhi,excellent,10,False,<NA>
3,NaN,0,NaN,HR,NaT,Hyderabad,excellent,5,yes,<NA>
4,NaN,<NA>,120000.75,IT,NaT,Delhi,NaN,-1,False,<NA>
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60,50000.00,HR,NaT,Delhi,2,five,NaN,<NA>
996,U1996,<NA>,NaN,IT,NaT,Mumbai,NaN,5,no,<NA>
997,USER_997,0,25000.00,HR,NaT,Mumbai,3,5,True,<NA>
998,U1998,<NA>,25000.00,NaN,NaT,Bangalore,1,0,True,<NA>
999,NaN,30,45000.00,HR,NaT,Hyderabad,excellent,five,no,<NA>

# 11 Convert performance_score into numeric by mapping text values to numbers.

In [15]:
df["performance_score"]=df["performance_score"].str.replace("excellent","5").str.replace("poor","1")
performance_score= pd.to_numeric(df['performance_score'], errors='coerce')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,<NA>,50000.00,HR,2020-01-12,Delhi,3,five,True,2020
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3,1,yes,<NA>
2,U1002,30,25000.00,HR,NaT,Delhi,5,10,False,<NA>
3,NaN,0,NaN,HR,NaT,Hyderabad,5,5,yes,<NA>
4,NaN,<NA>,120000.75,IT,NaT,Delhi,NaN,-1,False,<NA>
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60,50000.00,HR,NaT,Delhi,2,five,NaN,<NA>
996,U1996,<NA>,NaN,IT,NaT,Mumbai,NaN,5,no,<NA>
997,USER_997,0,25000.00,HR,NaT,Mumbai,3,5,True,<NA>
998,U1998,<NA>,25000.00,NaN,NaT,Bangalore,1,0,True,<NA>
999,NaN,30,45000.00,HR,NaT,Hyderabad,5,five,no,<NA>

# 12 clean experince years by converting text value to numeric and removing negative

In [16]:
df['experience_years'] = df['experience_years'].str.replace('five','5')
df['experience_years'] = pd.to_numeric(df['experience_years'], errors = 'coerce')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,<NA>,50000.00,HR,2020-01-12,Delhi,3,5.0,True,2020
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3,1.0,yes,<NA>
2,U1002,30,25000.00,HR,NaT,Delhi,5,10.0,False,<NA>
3,NaN,0,NaN,HR,NaT,Hyderabad,5,5.0,yes,<NA>
4,NaN,<NA>,120000.75,IT,NaT,Delhi,NaN,-1.0,False,<NA>
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60,50000.00,HR,NaT,Delhi,2,5.0,NaN,<NA>
996,U1996,<NA>,NaN,IT,NaT,Mumbai,NaN,5.0,no,<NA>
997,USER_997,0,25000.00,HR,NaT,Mumbai,3,5.0,True,<NA>
998,U1998,<NA>,25000.00,NaN,NaT,Bangalore,1,0.0,True,<NA>
999,NaN,30,45000.00,HR,NaT,Hyderabad,5,5.0,no,<NA>

# 13  Clean experience_years by converting text values to numeric and removing negatives.

In [17]:
df['experience_years'] = (
    df['experience_years']
    .astype(str)
    .str.replace('five', '5', case=False, regex=False)
)

experience = pd.to_numeric(df['experience_years'], errors='coerce')
df['experience_years'] = experience.astype('Int64')
df.loc[df['experience_years'] < 0, 'experience_years'] = 0


df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,<NA>,50000.00,HR,2020-01-12,Delhi,3,5,True,2020
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3,1,yes,<NA>
2,U1002,30,25000.00,HR,NaT,Delhi,5,10,False,<NA>
3,NaN,0,NaN,HR,NaT,Hyderabad,5,5,yes,<NA>
4,NaN,<NA>,120000.75,IT,NaT,Delhi,NaN,0,False,<NA>
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60,50000.00,HR,NaT,Delhi,2,5,NaN,<NA>
996,U1996,<NA>,NaN,IT,NaT,Mumbai,NaN,5,no,<NA>
997,USER_997,0,25000.00,HR,NaT,Mumbai,3,5,True,<NA>
998,U1998,<NA>,25000.00,NaN,NaT,Bangalore,1,0,True,<NA>
999,NaN,30,45000.00,HR,NaT,Hyderabad,5,5,no,<NA>

# 14  Convert is_active values (yes/no/True/False) into boolean format.

In [18]:
df['is_active'] = (
    df['is_active']
    .astype(str)
    .str.upper()
    .map({'YES': True, 'NO': False, 'TRUE': True, 'FALSE': False})
    .astype('boolean')  
)
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,<NA>,50000.00,HR,2020-01-12,Delhi,3,5,True,2020
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3,1,True,<NA>
2,U1002,30,25000.00,HR,NaT,Delhi,5,10,False,<NA>
3,NaN,0,NaN,HR,NaT,Hyderabad,5,5,True,<NA>
4,NaN,<NA>,120000.75,IT,NaT,Delhi,NaN,0,False,<NA>
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60,50000.00,HR,NaT,Delhi,2,5,<NA>,<NA>
996,U1996,<NA>,NaN,IT,NaT,Mumbai,NaN,5,False,<NA>
997,USER_997,0,25000.00,HR,NaT,Mumbai,3,5,True,<NA>
998,U1998,<NA>,25000.00,NaN,NaT,Bangalore,1,0,True,<NA>
999,NaN,30,45000.00,HR,NaT,Hyderabad,5,5,False,<NA>

# 15  Identify and remove duplicate records based on user_id.

In [19]:
df = df.drop_duplicates(subset="user_id")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,<NA>,50000.0,HR,2020-01-12,Delhi,3,5,True,2020
1,U1001,30,45000.0,FINANCE,NaT,Delhi,3,1,True,<NA>
2,U1002,30,25000.0,HR,NaT,Delhi,5,10,False,<NA>
3,NaN,0,NaN,HR,NaT,Hyderabad,5,5,True,<NA>
5,USER_5,<NA>,25000.0,IT,NaT,NaN,3,0,False,<NA>
...,...,...,...,...,...,...,...,...,...,...
990,U1990,<NA>,NaN,SALES,NaT,Hyderabad,NaN,0,False,<NA>
991,U1991,45,NaN,HR,NaT,Mumbai,NaN,0,True,<NA>
996,U1996,<NA>,NaN,IT,NaT,Mumbai,NaN,5,False,<NA>
997,USER_997,0,25000.0,HR,NaT,Mumbai,3,5,True,<NA>
998,U1998,<NA>,25000.0,NaN,NaT,Bangalore,1,0,True,<NA>

#  Create a clean final DataFrame containing only valid, standardized records.

In [20]:
df.head()

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,<NA>,50000.0,HR,2020-01-12,Delhi,3,5,True,2020
1,U1001,30,45000.0,FINANCE,NaT,Delhi,3,1,True,<NA>
2,U1002,30,25000.0,HR,NaT,Delhi,5,10,False,<NA>
3,NaN,0,NaN,HR,NaT,Hyderabad,5,5,True,<NA>
5,USER_5,<NA>,25000.0,IT,NaT,NaN,3,0,False,<NA>